ARTICLES = [
    ("1.1", "Вбивство", 30),
    ("1.3", "Умисне заподіяння тяжкої шкоди здоров'ю", 30),
    ("1.6", "Перешкоджання наданню медичної допомоги", 20),

    ("4.2", "Грабіж", 15),
    ("4.3", "Напад на інкасацію", 30),
    ("4.6", "Умисне знищення або пошкодження майна", 15),
    ("4.7", "Крадіжка авто", 20),

    ("5.1", "Терористичний акт", 30),
    ("5.2", "Сприяння терористичній діяльності", 20),
    ("5.4", "Захоплення заручника", 25),
    ("5.6", "Бандитизм", 15),
    ("5.7", "Організації злочинної спільноти або участь у ній", 25),
    ("5.9", "Масові заворушення", 15),
    ("5.10", "Хуліганство", 15),
    ("5.11", "Вандалізм", 15),
    ("5.12", "Незаконне проникнення на об'єкт, що охороняється", 30),
    ("5.13", "Незаконне придбання/передача/виготовлення зброї", 40),
    ("5.14", "Незаконне використання/носіння зброї", 40),
    ("5.15", "Збройне насильство під час мітингу", 50),
    ("5.16", "Порушення правил порядку", 20),

    ("6.3", "Створення ДТП", 20),

    ("7.1", "Незаконний продаж/купівля/зберігання наркотиків", 30),
    ("7.2", "Незаконне вживання наркотичних засобів", 30),

    ("8.1", "Посягання на життя державного діяча", 40),
    ("8.2", "Збройний заколот", 50),
    ("8.3", "Публічні заклики до здійснення екстремістської діяльності", 15),
    ("8.7", "Одержання хабаря", 60),
    ("8.8", "Одержання хабаря", 40),

    ("9.8", "Втеча від погоні", 25),
    ("9.9", "Несплата штрафів", 30),

    ("10.1", "Посягання на життя співробітника правоохоронного органу", 40),
    ("10.2", "Застосування насильства щодо представника влади", 50),
    ("10.3", "Образа представника державної організації", 15),
    ("10.4", "Провокація співробітника державної організації", 10),
    ("10.5", "Перешкода співробітникам правоохоронних органів", 15),
    ("10.7", "Перешкода транспортному засобу з проблисковими маячками", 25),
    ("10.8", "Здійснення нападу на колону", 40),
    ("10.9", "Непідкорення співробітнику правоохоронних органів", 20),
    ("10.10", "Непокора поліцейському під час НС", 40),
    ("10.11", "Втеча під час затримання", 40),

    ("11.8", "Уникнення призову", 50),

    ("12.1", "Порушення правил перетину Блокпоста", 25),

    ("13.5", "Спроба дати хабар", 20),
]


def search_articles(query: str):
    query = query.casefold().strip()

    if not query:
        return ARTICLES

    result = []

    for number, title, minutes in ARTICLES:
        if (
            query in number.casefold()
            or query in title.casefold()
        ):
            result.append((number, title, minutes))

    return result