FINES = [
    ("1.6", "Викрадення особи", "30000 грн."),
    ("1.9", "Грабіж", "30000 грн."),
    ("1.12", "Вихід із гри під час РП процесу", "50000 грн."),
    ("1.13", "Зберігання забороненої зброї", "10000 грн."),
    ("1.14", "Порушення правил Блокпосту", "10000 грн."),
    ("1.15", "Шахрайство", "60000 грн."),
    ("1.16", "Розбій", "40000 грн."),

    ("2.6", "Їзда по тротуарах", "10000 грн."),
    ("2.7", "Їзда по узбіччі", "15000 грн."),
    ("2.13", "Недотримання знаків правил дорожнього руху", "40500 грн."),
    ("2.14", "Винуватець ДТП", "40500 грн."),
    ("2.15", "Їзда по зустрічній смузі", "60000 грн."),

    ("3.6", "Використання стробоскопів на транспорті", "500000 грн."),
    ("3.7", "Порушення правил тонування вікон", "100000 грн."),
    ("3.8", "Перевищення обмежень швидкості руху", "30000 грн."),
    ("3.9", "Проїзд на червоне світло", "10000 грн."),

    ("4.0", "Перетнув подвійну суцільну смугу", "15000 грн."),
    ("4.1", "Невиконання вимоги на зупинку", "20000 грн."),
    ("4.2", "Покидання місця ДТП", "80000 грн."),
    ("4.3", "Їзда на авто без номерних знаків", "40000 грн."),
    ("4.4", "Створення аварійної ситуації", "70000 грн."),
    ("4.5", "Здійснення випереджувального маневру в забороненому місці", "50000 грн."),
    ("4.6", "Неправильне паркування транспортного засобу", "25000 грн."),
    ("4.7", "В'їзд в заборонену зону", "33500 грн."),
    ("4.8", "Їзда по газонах", "55000 грн."),
    ("4.9", "Небезпечне водіння транспортним засобом", "47500 грн."),
    ("4.10", "Керування транспортним засобом без посвідчення водія", "55500 грн."),

    ("5.0", "Їзда по залізничних коліях", "25000 грн."),
    ("5.1", "Порушення правил перевезення пасажирів", "100000 грн."),
    ("5.2", "Їзда на зламаному автомобілі", "40000 грн."),
    ("5.3", "Їзда на пошкодженому автомобілі", "20000 грн."),
    ("5.4", "Проїзд на заборонений сигнал переїзду", "25000 грн."),
    ("5.5", "Зупинка транспортного засобу на мості", "20000 грн."),
    ("5.6", "Порушення порядку в громадських місцях", "15000 грн."),
    ("5.7", "Наїзд на пішохода", "30000 грн."),
    ("5.8", "Здійснення маневру без повороту", "25000 грн."),
    ("5.9", "Помилковий виклик", "15000 грн."),
    ("5.10", "Рух без включених габаритних вогнів", "10000 грн."),

    ("6.0", "Створення перешкоди руху", "25000 грн."),
    ("6.1", "Перевищення обмежень швидкості руху", "8250 грн."),
]


def search_fines(query):
    query = query.casefold().strip()

    if not query:
        return FINES

    return [
        fine
        for fine in FINES
        if query in fine[0].casefold()
        or query in fine[1].casefold()
    ]